src/Catalogs/ПолитикиМФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПолитикиМФП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаЗакупкаУВнешнихПоставщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПродажаВнешнимКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПокупкаУСобственныхОрганизаций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныеОрганизацииРазрешенаПокупкаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СобственныеОрганизацииРазрешенаПокупка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПолитикиМФП/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВнешнийВидФормы()
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДействияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры


//Прочее

&НаКлиенте
Процедура УстановитьВнешнийВидФормы()
	Элементы.ГруппаПокупка.Видимость 					= Объект.РазрешенаПокупкаУСобственныхОрганизаций;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = ""+Объект.Владелец+" от "+Формат(Объект.ПериодДействия, "ДФ=dd.MM.yyyy")+"г.";	
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыПолитикиНаСервере()
	
	ПараметрыПолитики = Справочники.ПолитикиМФП.ПолучитьПараметрыПолитикиМФПДляОрганизации(ОБъект.Владелец, ТекущаяДата());
	
	Для каждого СтрокаТЗ ИЗ ПараметрыПолитики.ОрганизацииДляЗакупки Цикл
		Сообщить("Организация закупки: "+СтрокаТЗ.Организация+" приоритет: "+СтрокаТЗ.Приоритет);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПолитики(Команда)
	ПараметрыПолитикиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазрешенаПокупкаУСобственныхОрганизацийПриИзменении(Элемент)
	УстановитьВнешнийВидФормы();
КонецПроцедуры
